---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailGometryCreationFailure
source: html/723e2600-b177-ea13-855a-718be554987b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.ContinuousRailGometryCreationFailure Property

Cannot create the continuous rail geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId ContinuousRailGometryCreationFailure { get; }
```